In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

## Introduction to pandas Data Structures

### Series

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
# creating an index identifying each data point
obj2 = pd.Series([4, 7, -5, 2], index=['d', 'b', 'c', 'a'])

In [8]:
obj2

d    4
b    7
c   -5
a    2
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'c', 'a'], dtype='object')

In [10]:
obj2.values

array([ 4,  7, -5,  2], dtype=int64)

In [11]:
# We can call them by values
obj2['a']

2

In [12]:
# and assign
obj2['b'] = 6

In [13]:
obj2[['c', 'a', 'd']]

c   -5
a    2
d    4
dtype: int64

In [14]:
obj2

d    4
b    6
c   -5
a    2
dtype: int64

In [15]:
# some bool operations
obj2[obj2 > 0]

d    4
b    6
a    2
dtype: int64

In [16]:
# multiplications
obj2 * 2

d     8
b    12
c   -10
a     4
dtype: int64

In [17]:
# exponent function from numpy
import numpy as np
np.exp(obj2)

d     54.598150
b    403.428793
c      0.006738
a      7.389056
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
'e' in obj2

False

In [20]:
# creating a series out of dictionary
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [21]:
obj3 = pd.Series(sdata)

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
# adjusting the order as per keys
states = ['California', 'Ohio', 'Oregon', 'Texas']
# observe the keys passed and actually available.
# If the key is not passed as index, non matching arguments in the dict will be removed.
# If the value don't exist for the passed key, value will be NaN.

In [24]:
obj4 = pd.Series(sdata, index=states)

In [25]:
obj4  # NaN is not a number as the key don't exist.

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
# Bool response for checking the null values
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
# calling by instance methods
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

obj3 + obj4

In [37]:
obj4.name = 'population'  # naming the object

In [38]:
obj4.index.name = 'state'  # naming the index

In [39]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [40]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [41]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [42]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [44]:
# Creating dataframe from dict of equal list of numpy arrays
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [45]:
frame = pd.DataFrame(data)

In [46]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [47]:
# Using head to select first 5 rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [48]:
# Re-arranging the columns
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [50]:
# passing columns that are'nt in the dict.
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [51]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [52]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [53]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [56]:
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [58]:
# modifying column level data with assignment
frame2['debt'] = 16.5

In [59]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [60]:
# using numpy to set the column level data.
frame2['debt'] = np.arange(6.)

In [61]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [65]:
# writing inconsistent data into dataframe
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [66]:
frame2['debt'] = val

In [67]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [69]:
# Creating a new column
frame2['eastern'] = frame2.state  == 'Ohio'  # mark as true if state is Ohio at the new column state.

In [71]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [72]:
# deleting the newly created frame
del frame2['eastern']

In [73]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [74]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [75]:
# one more common from, nested dict of dicts
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [76]:
frame3 = pd.DataFrame(pop)

In [77]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [78]:
# transposing.
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [81]:
# Specifying an expected index
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [82]:
# Dicts of Series are treated in much the same way
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [83]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

### Index Objects

In [84]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [85]:
obj

a    0
b    1
c    2
dtype: int64

In [86]:
index = obj.index

In [87]:
index

Index(['a', 'b', 'c'], dtype='object')